read_verilog ../encoder_case.v
hierarchy -check -top encoder_case
proc; opt; fsm; opt; memory; opt
techmap; opt
dfflibmap -liberty ../osu025_stdcells.lib
abc -D 10000 -constr ../synth.contr -liberty ../osu025_stdcells.lib 
stat -liberty ../osu025_stdcells.lib
clean
write_verilog ../encoder_case_synth.v
exit
