read_verilog ../counter.v
hierarchy -check -top counter
proc; opt; fsm; opt; memory; opt
techmap; opt
dfflibmap -liberty ../osu025_stdcells.lib
abc -D 10000 -constr ../synth.contr -liberty ../osu025_stdcells.lib 
stat -liberty ../osu025_stdcells.lib
clean
write_verilog ../counter_synth.v
exit
